[
    {
        "id": 1,
        "category_id": 1,
        "title": "ঘুম থেকে ওঠার পর দোয়া",
        "arabic": "الْحَمْدُ لِلَّهِ الَّذي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
        "pronunciation": "আলহামদু লিল্লাহিল্লাজি আহইয়ানা বা‘দা মা আমাতানা ওয়া ইলাইহিন নুশূর",
        "translation": "সকল প্রশংসা আল্লাহর জন্য যিনি আমাদের মৃত্যু (ঘুম)-র পর আমাদের জীবিত করেছেন। আর তাঁর দিকেই আমাদের পুনরুত্থান।",
        "reference": "বুখারী: ৬৩১২"
    },
    {
        "id": 2,
        "category_id": 1,
        "title": "টয়লেটে প্রবেশের দোয়া",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
        "pronunciation": "আল্লাহুম্মা ইন্নি আউযুবিকা মিনাল খুবুসি ওয়াল খাবাইস",
        "translation": "হে আল্লাহ! আমি তোমার কাছে পুরুষ ও স্ত্রী শয়তান থেকে আশ্রয় চাই।",
        "reference": "বুখারী: ১৪২"
    },
    {
        "id": 3,
        "category_id": 1,
        "title": "টয়লেট থেকে বের হওয়ার দোয়া",
        "arabic": "غُفْرَانَكَ",
        "pronunciation": "গুফরানাকা",
        "translation": "হে আল্লাহ! আমি তোমার ক্ষমা প্রার্থনা করছি।",
        "reference": "আবু দাউদ: ৩০"
    },
    {
        "id": 4,
        "category_id": 1,
        "title": "ওজু শুরুর দোয়া",
        "arabic": "بِسْمِ ٱللَّٰهِ",
        "pronunciation": "বিসমিল্লাহ",
        "translation": "আল্লাহর নামে শুরু করছি।",
        "reference": "আবু দাউদ: ১০১"
    },
    {
        "id": 5,
        "category_id": 1,
        "title": "ওজু শেষের দোয়া",
        "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
        "pronunciation": "আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু",
        "translation": "আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোনো মাবুদ নেই। তিনি একক, তাঁর কোনো শরীক নেই। আমি আরও সাক্ষ্য দিচ্ছি যে, মুহাম্মদ (সা.) তাঁর বান্দা ও রাসূল।",
        "reference": "মুসলিম: ২৩৪"
    },
    {
        "id": 6,
        "category_id": 1,
        "title": "ঘর থেকে বের হওয়ার দোয়া",
        "arabic": "بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
        "pronunciation": "বিসমিল্লাহি তাওয়াক্কালতু আলাল্লাহ, ওয়ালা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ",
        "translation": "আল্লাহর নামে (বের হচ্ছি), আল্লাহর ওপর ভরসা করলাম। আর আল্লাহ ছাড়া কোনো ক্ষমতা বা শক্তি নেই।",
        "reference": "আবু দাউদ: ৫০৯৫"
    },
    {
        "id": 7,
        "category_id": 1,
        "title": "ঘরে প্রবেশের দোয়া",
        "arabic": "بِسْمِ اللهِ وَلَجْنَا، وَ بِسْمِ اللهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا",
        "pronunciation": "বিসমিল্লাহি ওয়ালাজনা, ওয়া বিসমিল্লাহি খারাজনা, ওয়া আলা রাব্বিনা তাওয়াক্কালনা",
        "translation": "আল্লাহর নামে প্রবেশ করলাম, আল্লাহর নামেই বের হলাম এবং আমাদের রব আল্লাহর ওপরই ভরসা করলাম।",
        "reference": "আবু দাউদ: ৫০৯৬"
    },
    {
        "id": 8,
        "category_id": 1,
        "title": "মসজিদে প্রবেশের দোয়া",
        "arabic": "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
        "pronunciation": "আল্লাহুম্মাফ তাহলি আবওয়াবা রাহমাতিক",
        "translation": "হে আল্লাহ! আমার জন্য তোমার রহমতের দরজাগুলো খুলে দাও।",
        "reference": "মুসলিম: ৭১৩"
    },
    {
        "id": 9,
        "category_id": 1,
        "title": "মসজিদ থেকে বের হওয়ার দোয়া",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
        "pronunciation": "আল্লাহুম্মা ইন্নি আসআলুকা মিন ফাদলিক",
        "translation": "হে আল্লাহ! আমি তোমার কাছে তোমার অনুগ্রহ কামনা করছি।",
        "reference": "মুসলিম: ৭১৩"
    },
    {
        "id": 10,
        "category_id": 1,
        "title": "আয়না দেখার দোয়া",
        "arabic": "اللَّهُمَّ حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
        "pronunciation": "আল্লাহুম্মা হাসানতা খালকি ফাহাসসিন খুলুকি",
        "translation": "হে আল্লাহ! তুমি আমার সৃষ্টিকে সুন্দর করেছ, তাই আমার চরিত্রকেও সুন্দর করে দাও।",
        "reference": "ইবনে হিব্বান: ৯৫৯"
    },
    {
        "id": 11,
        "category_id": 1,
        "title": "পোশাক পরিধানের দোয়া",
        "arabic": "الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
        "pronunciation": "আলহামদু লিল্লাহিল্লাজি কাসানি হাজা ওয়া রাজাকানিহি মিন গাইরি হাওলিম মিন্নি ওয়ালা কুওয়াহ",
        "translation": "সকল প্রশংসা আল্লাহর জন্য যিনি আমাকে এই পোশাক পরিয়েছেন এবং আমার কোনো শক্তি-সামর্থ্য ছাড়াই তা দান করেছেন।",
        "reference": "সুনানে আবু দাউদ: ৪০২৩"
    },
    {
        "id": 12,
        "category_id": 1,
        "title": "নতুন পোশাক পরিধানের দোয়া",
        "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
        "pronunciation": "আল্লাহুম্মা লাকাল হামদু আনতা কাসাওতানিহি আসআলুকা মিন খাইরিহি ওয়া খাইরি মা সুনিআ লাহু ওয়া আউযুবিকা মিন শাররিহি ওয়া শাররি মা সুনিআ লাহু",
        "translation": "হে আল্লাহ! তোমারই প্রশংসা, তুমিই আমাকে এ পোশাক পরিয়েছ। আমি তোমার কাছে এর কল্যাণ এবং যে উদ্দেশ্যে এটি তৈরি হয়েছে তার কল্যাণ প্রার্থনা করছি। আর এর অনিষ্ট এবং যে উদ্দেশ্যে এটি তৈরি হয়েছে তার অনিষ্ট থেকে তোমার আশ্রয় চাই।",
        "reference": "আবু দাউদ: ৪০২০"
    },
    {
        "id": 13,
        "category_id": 1,
        "title": "খাওয়ার পূর্বের দোয়া",
        "arabic": "بِسْمِ اللهِ",
        "pronunciation": "বিসমিল্লাহ",
        "translation": "আল্লাহর নামে (শুরু করছি)।",
        "reference": "বুখারী: ৫৩৭৬"
    },
    {
        "id": 14,
        "category_id": 1,
        "title": "খাওয়ার মাঝখানে মনে পড়লে দোয়া",
        "arabic": "بِسْمِ اللهِ أَوَّلَهُ وَآخِرَهُ",
        "pronunciation": "বিসমিল্লাহি আউওয়ালাহু ওয়া আখিরাহু",
        "translation": "আমি এর শুরুতে এবং শেষে আল্লাহর নাম নিলাম।",
        "reference": "আবু দাউদ: ৩৭৬৭"
    },
    {
        "id": 15,
        "category_id": 1,
        "title": "খাওয়ার শেষের দোয়া",
        "arabic": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
        "pronunciation": "আলহামদু লিল্লাহিল্লাজি আতআমানা ওয়া সাকানা ওয়া জাআলানা মুসলিমীন",
        "translation": "সকল প্রশংসা আল্লাহর জন্য, যিনি আমাদের আহার করিয়েছেন, পান করিয়েছেন এবং মুসলিম হিসেবে সৃষ্টি করেছেন।",
        "reference": "তিরমিযি: ৩৪৫৭"
    },
    {
        "id": 16,
        "category_id": 2,
        "title": "সকাল-সন্ধ্যা সুরক্ষার দোয়া",
        "arabic": "بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
        "pronunciation": "বিসমিল্লাহিল্লাজি লা ইয়াদুররু মাআসইমিহি শাইউন ফিল আরদি ওয়ালা ফিস সামাই ওয়াহুয়াস সামীউল আলীম",
        "translation": "আল্লাহর নামে, যার নামের বরকতে আসমান ও জমিনের কোনো কিছুই কোনো ক্ষতি করতে পারে না। তিনি সব শোনেন, সব জানেন।",
        "reference": "তিরমিযি: ৩৩৮৮"
    },
    {
        "id": 17,
        "category_id": 2,
        "title": "শয়তান থেকে সুরক্ষার দোয়া",
        "arabic": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
        "pronunciation": "আউযুবিল্লাহি মিনাশ শাইতানির রাজীম",
        "translation": "বিতাড়িত শয়তান থেকে আল্লাহর কাছে আশ্রয় চাই।",
        "reference": "কুরআন"
    },
    {
        "id": 18,
        "category_id": 2,
        "title": "দুশ্চিন্তা ও ঋণ থেকে মুক্তির দোয়া",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
        "pronunciation": "আল্লাহুম্মা ইন্নি আউযুবিকা মিনাল হাম্মি ওয়াল হাযানি, ওয়াল আজযি ওয়াল কাসালি, ওয়াল বুখলি ওয়াল জুবনি, ওয়া দালাঈদ দাইনি ওয়া গালাবাতির রিজাল",
        "translation": "হে আল্লাহ! আমি তোমার আশ্রয় চাই দুশ্চিন্তা ও দুঃখ থেকে, অক্ষমতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণের ভার ও মানুষের দমন-পীড়ন থেকে।",
        "reference": "বুখারী: ৬৩৬৩"
    },
    {
        "id": 19,
        "category_id": 2,
        "title": "শত্রুর অনিষ্ট থেকে বাঁচার দোয়া",
        "arabic": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ",
        "pronunciation": "আল্লাহুম্মা ইন্না নাজআলুকা ফি নুহূরিহিম, ওয়া নাউজুবিকা মিন শুরূরিহিম",
        "translation": "হে আল্লাহ! আমরা তোমাকেই তাদের মুখোমুখি করছি এবং তাদের অনিষ্ট থেকে তোমার আশ্রয় চাইছি।",
        "reference": "আবু দাউদ: ১৫৩৭"
    },
    {
        "id": 20,
        "category_id": 2,
        "title": "খারাপ সংবাদ শোনার পর দোয়া",
        "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
        "pronunciation": "ইন্না লিল্লাহি ওয়া ইন্না ইলাইহি রাজিউন, আল্লাহুম্মা আজুরনি ফি মুসিবাতি ওয়া আখলিফ লি খাইরাম মিনহা",
        "translation": "আমরা তো আল্লাহরই এবং নিশ্চয়ই আমরা তাঁর দিকেই ফিরে যাব। হে আল্লাহ! আমাকে আমার বিপদে সওয়াব দান করো এবং এর চেয়ে উত্তম কিছু বিনিময় দান করো।",
        "reference": "মুসলিম: ৯১৮"
    },
    {
        "id": 21,
        "category_id": 2,
        "title": "রাগ দমনের দোয়া",
        "arabic": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
        "pronunciation": "আউযুবিল্লাহি মিনাশ শাইতানির রাজীম",
        "translation": "আমি বিতাড়িত শয়তান থেকে আল্লাহর আশ্রয় চাই।",
        "reference": "বুখারী: ৩২৮২"
    },
    {
        "id": 22,
        "category_id": 2,
        "title": "ঝড়-তুফানের সময় দোয়া",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ",
        "pronunciation": "আল্লাহুম্মা ইন্নি আসআলুকা খাইরাহা ওয়া খাইরা মা ফীহা ওয়া খাইরা মা উরসিলাত বিহ, ওয়া আউযুবিকা মিন শাররিহা ওয়া শাররি মা ফীহা ওয়া শাররি মা উরসিলাত বিহ",
        "translation": "হে আল্লাহ! আমি তোমার কাছে এর কল্যাণ, এর মধ্যস্থিত কল্যাণ এবং যা নিয়ে তা প্রেরিত হয়েছে তার কল্যাণ প্রার্থনা করছি। এবং আমি তোমার আশ্রয় চাই এর অনিষ্ট, এর মধ্যস্থিত অনিষ্ট এবং যা নিয়ে তা প্রেরিত হয়েছে তার অনিষ্ট থেকে।",
        "reference": "মুসলিম: ৮৯৯"
    },
    {
        "id": 23,
        "category_id": 2,
        "title": "বিপদাপদ থেকে মুক্তির দোয়া",
        "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
        "pronunciation": "লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নি কুনতু মিনাজ জালিমীন",
        "translation": "তুমি ছাড়া কোনো মাবুদ নেই, তুমি পবিত্র মহান। নিশ্চয়ই আমি জালিমদের অন্তর্ভুক্ত।",
        "reference": "তিরমিযি: ৩৫০৫"
    },
    {
        "id": 24,
        "category_id": 2,
        "title": "মেঘের গর্জনের দোয়া",
        "arabic": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ",
        "pronunciation": "সুবহানাল্লাজি ইউসাব্বিহুর রা‘দু বিহামদিহি ওয়াল মালাইকাতু মিন খীফাতিহি",
        "translation": "পবিত্র সেই মহান সত্তা, যার প্রশংসায় মেঘের গর্জন এবং ফেরেশতারা ভয়ে তসবিহ পাঠ করে।",
        "reference": "মুওয়াত্তা মালিক"
    },
    {
        "id": 25,
        "category_id": 2,
        "title": "ঘুমের সময় সুরক্ষার দোয়া",
        "arabic": "بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
        "pronunciation": "বিসমিকা রাব্বি ওয়াদাতু জানবি, ওয়া বিকা আরফাউহু, ফাইন আমসাকতা নাফসি ফারহামহা, ওয়া ইন আরসালতাহা ফাহফাজহা বিমা তাহফাযু বিহি ইবাদাকাস সালিহীন",
        "translation": "হে আমার রব! তোমার নামে আমি পাশ ফিরে শুলাম এবং তোমার নামেই আমি উঠব। যদি তুমি আমার রুহ কবজ করো, তবে তার প্রতি রহম করো। আর যদি তা ফেরত দাও, তবে তাকে এমনভাবে হেফাজত করো, যেভাবে তুমি তোমার নেক বান্দাদের হেফাজত করো।",
        "reference": "বুখারী: ৬৩২০"
    },
    {
        "id": 26,
        "category_id": 3,
        "title": "রোগ মুক্তির দোয়া",
        "arabic": "اللَّهُمَّ رَبَّ النَّاسِ أَذْهِبِ الْبَاسَ اشْفِهِ وَأَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا",
        "pronunciation": "আল্লাহুম্মা রব্বান নাসি আজহিবিল বা‘সা ইশফিহি ওয়া আনতাশ শাফী লা শিফাউকা ইল্লা শিফাউকা শিফায়ান লা ইউগাদিরু সাকামা",
        "translation": "হে আল্লাহ! মানুষের রব, কষ্ট দূর করো এবং আরোগ্য দান করো। তুমিই আরোগ্যদানকারী। তোমার আরোগ্য ছাড়া কোনো আরোগ্য নেই। এমন আরোগ্য দান করো যা কোনো রোগ বাকি রাখে না।",
        "reference": "বুখারী: ৫৭৫০"
    },
    {
        "id": 27,
        "category_id": 3,
        "title": "শরীরের ব্যথার দোয়া",
        "arabic": "بِسْمِ اللهِ (৩ বার) - أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ (৭ বার)",
        "pronunciation": "বিসমিল্লাহ (৩ বার), আউযুবিল্লাহি ওয়া কুদরাতিহি মিন শাররি মা আজিসু ওয়া উহাজিরু (৭ বার)",
        "translation": "আল্লাহর নামে। আমি আল্লাহর সত্তা ও ক্ষমতার উসিলায় আমি যে ব্যথা অনুভব করছি এবং যার আশঙ্কা করছি, তার অনিষ্ট থেকে আশ্রয় চাই।",
        "reference": "মুসলিম: ২২০২"
    },
    {
        "id": 28,
        "category_id": 3,
        "title": "সুস্থতার জন্য দোয়া",
        "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
        "pronunciation": "আল্লাহুম্মা আফিনি ফি বাদানি, আল্লাহুম্মা আফিনি ফি সামঈ, আল্লাহুম্মা আফিনি ফি বাসারি, লা ইলাহা ইল্লা আনতা",
        "translation": "হে আল্লাহ! আমার দেহ সুস্থ রাখো। হে আল্লাহ! আমার শ্রবণশক্তি সুস্থ রাখো। হে আল্লাহ! আমার দৃষ্টিশক্তি সুস্থ রাখো। তুমি ছাড়া কোনো মাবুদ নেই।",
        "reference": "আবু দাউদ: ৫০৯০"
    },
    {
        "id": 29,
        "category_id": 3,
        "title": "রুগী দেখার দোয়া",
        "arabic": "أَسْأَلُ اللهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ",
        "pronunciation": "আসআলুল্লাহাল আজীম রব্বাল আরশিল আজীম আই ইয়াশফিয়াক",
        "translation": "আমি মহান আল্লাহর কাছে যিনি মহান আরশের রব, তোমার আরোগ্য কামনা করছি। (৭ বার)",
        "reference": "তিরমিযি: ২০৮৩"
    },
    {
        "id": 30,
        "category_id": 3,
        "title": "মহামারী থেকে রক্ষার দোয়া",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ وَمِنْ سَيِّئِ الْأَسْقَامِ",
        "pronunciation": "আল্লাহুম্মা ইন্নি আউযুবিকা মিনাল বারাসি ওয়াল জুনূনি ওয়াল জুযামি ওয়া মিন সাইয়্যিইল আসকাম",
        "translation": "হে আল্লাহ! আমি তোমার কাছে শ্বেত রোগ, পাগলামি, কুষ্ঠ এবং কঠিন ব্যাধি থেকে আশ্রয় চাই।",
        "reference": "আবু দাউদ: ১৫৫৪"
    },
    {
        "id": 31,
        "category_id": 3,
        "title": "হাঁচি দেওয়ার পর দোয়া",
        "arabic": "الْحَمْدُ لِلَّهِ",
        "pronunciation": "আলহামদু লিল্লাহ",
        "translation": "সকল প্রশংসা আল্লাহর জন্য।",
        "reference": "বুখারী: ৬২২৬"
    },
    {
        "id": 32,
        "category_id": 3,
        "title": "হাঁচির জবাব দেয়ার দোয়া",
        "arabic": "يَرْحَمُكَ اللهُ",
        "pronunciation": "ইয়ারহামুকাল্লাহ",
        "translation": "আল্লাহ তোমার ওপর রহম করুন।",
        "reference": "বুখারী: ৬২২৬"
    },
    {
        "id": 33,
        "category_id": 3,
        "title": "হাঁচির জবাবে প্রত্যুত্তর",
        "arabic": "يَهْدِيكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
        "pronunciation": "ইয়াহদিকুমুল্লাহু ওয়া ইউসলিহু বালাকুম",
        "translation": "আল্লাহ তোমাদের হেদায়েত দিন এবং তোমাদের অবস্থা সংশোধন করে দিন।",
        "reference": "বুখারী: ৬২২৬"
    },
    {
        "id": 34,
        "category_id": 3,
        "title": "ঔষধ খাওয়ার সময়",
        "arabic": "يَا شَافِي",
        "pronunciation": "ইয়া শাফী",
        "translation": "হে আরোগ্যদানকারী।",
        "reference": "মাসনূন"
    },
    {
        "id": 35,
        "category_id": 3,
        "title": "জীবন ও মৃত্যুর ফিতনা থেকে বাঁচার দোয়া",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ",
        "pronunciation": "আল্লাহুম্মা ইন্নি আউযুবিকা মিন ফিতনাতিল মাহয়া ওয়াল মামাত",
        "translation": "হে আল্লাহ! আমি তোমার কাছে জীবন ও মৃত্যুর ফিতনা থেকে আশ্রয় কামনা করছি।",
        "reference": "বুখারী: ১৩৭৭"
    },
    {
        "id": 36,
        "category_id": 4,
        "title": "চাঁদ দেখার দোয়া",
        "arabic": "اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلَامَةِ وَالْإِسْلَامِ، رَبِّي وَرَبُّكَ اللهُ",
        "pronunciation": "আল্লাহুম্মা আহিল্লাহু আলাইনা বিল আমনি ওয়াল ঈমান, ওয়াস সালামাতি ওয়াল ইসলাম, রাব্বি ওয়া রাব্বুকাল্লাহ",
        "translation": "হে আল্লাহ! তুমি এই চাঁদকে আমাদের ওপর উদিত করো নিরাপত্তা, ঈমান, শান্তি ও ইসলামের সাথে। (হে চাঁদ) আমার ও তোমার রব আল্লাহ।",
        "reference": "তিরমিযি: ৩৪৫১"
    },
    {
        "id": 37,
        "category_id": 4,
        "title": "রোজার নিয়ত",
        "arabic": "نَوَيْتُ اَنْ اُصُوْمَ غَدًا مِّنْ شَهْرِ رَمْضَانَ الْمُبَارَكِ فَرْضًا لَكَ يَا اللهُ فَتَقَبَّل مِنِّى اِنَّكَ اَنْتَ السَّمِيْعُ الْعَلِيْم",
        "pronunciation": "নাওয়াইতু আন আসুমা গদাম মিন শাহরি রমজানাল মুবারাকি ফারদাল লাকা ইয়া আল্লাহু ফাতাকাববাল মিন্নি ইন্নাকা আনতাস সামীউল আলীম",
        "translation": "হে আল্লাহ! আগামীকাল পবিত্র রমজান মাসের ফরজ রোজা রাখার নিয়ত করলাম, তাই তুমি আমার পক্ষ থেকে তা কবুল করো, নিশ্চয়ই তুমি সর্বশ্রোতা ও সর্বজ্ঞানী।",
        "reference": "প্রচলিত"
    },
    {
        "id": 38,
        "category_id": 4,
        "title": "ইফতারের দোয়া",
        "arabic": "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللهُ",
        "pronunciation": "জাহাবাজ জামাউ ওয়াবতাল্লাতিল উরূকু ওয়া সাবাতাল আজরু ইনশাআল্লাহ",
        "translation": "পিপাসা নিবারিত হয়েছে, শিরা-উপশিরা সিক্ত হয়েছে এবং আল্লাহর ইচ্ছায় পুরস্কার নির্ধারিত হয়েছে।",
        "reference": "আবু দাউদ: ২৩৫৭"
    },
    {
        "id": 39,
        "category_id": 4,
        "title": "লাইলাতুল কদরের দোয়া",
        "arabic": "اللَّهُمَّ إِنَّكَ عُفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
        "pronunciation": "আল্লাহুম্মা ইন্নাকা আফুউবুন, তুহিব্বুল আফওয়া ফা‘ফু আন্নি",
        "translation": "হে আল্লাহ! তুমি ক্ষমাশীল, ক্ষমা করতে ভালোবাসো, তাই আমাকে ক্ষমা করো।",
        "reference": "তিরমিযি: ৩৫১৩"
    },
    {
        "id": 40,
        "category_id": 4,
        "title": "কারো ঘরে ইফতার করার দোয়া",
        "arabic": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الْأَبْرَارُ، وَصَلَّتْ عَلَيْكُمُ الْمَلَائِكَةُ",
        "pronunciation": "আফতারা ইনদাকুমুস সায়িমূন, ওয়া আকালা তয়্যামাকুমুল আবরার, ওয়া সাল্লাত আলাইকুমুল মালাইকাহ",
        "translation": "রোজাদারগণ তোমাদের কাছে ইফতার করুক, নেককাররা তোমাদের খাবার গ্রহণ করুক এবং ফেরেশতারা তোমাদের জন্য রহমতের দোয়া করুক।",
        "reference": "আবু দাউদ: ৩৮৫৪"
    },
    {
        "id": 41,
        "category_id": 4,
        "title": "রমজানে বেশি বেশি পড়ার দোয়া - ১",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
        "pronunciation": "আল্লাহুম্মা ইন্নি আসআলুকাল জান্নাতা ওয়া আউযুবিকা মিনান নার",
        "translation": "হে আল্লাহ! আমি তোমার নিকট জান্নাত চাই এবং জাহান্নাম থেকে আশ্রয় চাই।",
        "reference": "বুখারী"
    },
    {
        "id": 42,
        "category_id": 4,
        "title": "রমজানে বেশি বেশি পড়ার দোয়া - ২",
        "arabic": "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ",
        "pronunciation": "আস্তাগফিরুল্লাহ ওয়া আতূবু ইলাইহি",
        "translation": "আমি আল্লাহর ক্ষমা প্রার্থনা করছি এবং তাঁর দিকেই ফিরে আসছি।",
        "reference": "বুখারী: ৬৩০৭"
    },
    {
        "id": 43,
        "category_id": 4,
        "title": "রমজানের শেষ দশকের দোয়া",
        "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "pronunciation": "রাব্বানা আতিনা ফিদ দুনিয়া হাসানাহ ওয়া ফিল আখিরাতি হাসানাহ ওয়া কিনা আজাবান নার",
        "translation": "হে আমাদের রব! আমাদের দুনিয়াতে কল্যাণ দাও এবং আখেরাতেও কল্যাণ দাও এবং আমাদের আগুনের আজাব থেকে রক্ষা করো।",
        "reference": "সূরা বাকারা: ২০১"
    },
    {
        "id": 44,
        "category_id": 5,
        "title": "আজানের পর দোয়া",
        "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
        "pronunciation": "আল্লাহুম্মা রব্বা হাজিহিদ দাওয়াতিত তাম্মাহ ওয়াস সালাতিল কায়িমাহ, আতি মুহাম্মাদানিল ওয়াসিলাতা ওয়াল ফাদীলাহ, ওয়াবআসজু মাকামাম মাহমূদানিল্লাজি ওয়াআদতাহ",
        "translation": "হে আল্লাহ! এই পরিপূর্ণ আহ্বান ও আসন্ন সালাতের তুমিই রব। মুহাম্মদ (সা.)-কে অসিলা ও ফজিলত দান করো এবং তাঁকে সেই মাকামে মাহমুদে পৌঁছে দাও, যার ওয়াদা তুমি তাঁকে করেছ।",
        "reference": "বুখারী: ৬১৪"
    },
    {
        "id": 45,
        "category_id": 5,
        "title": "মসজিদে প্রবেশের দোয়া",
        "arabic": "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
        "pronunciation": "আল্লাহুম্মাফ তাহলি আবওয়াবা রাহমাতিক",
        "translation": "হে আল্লাহ! আমার জন্য তোমার রহমতের দরজাগুলো খুলে দাও।",
        "reference": "মুসলিম: ৭১৩"
    },
    {
        "id": 46,
        "category_id": 5,
        "title": "তাকবীরে তাহরীমার পর সানা",
        "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرُكَ",
        "pronunciation": "সুবহানাকা আল্লাহুম্মা ওয়া বিহামদিকা ওয়া তাবারাকাসমুকা ওয়া তাআলা জাদ্দুকা ওয়া লা ইলাহা গাইরুক",
        "translation": "হে আল্লাহ! তুমি পবিত্র, সকল প্রশংসা তোমারই। তোমার নাম বরকতময়, তোমার মর্যাদা অতি উচ্চ এবং তুমি ছাড়া কোনো মাবুদ নেই।",
        "reference": "মুসলিম"
    },
    {
        "id": 47,
        "category_id": 5,
        "title": "রুকু থেকে ওঠার পর দোয়া",
        "arabic": "رَبَّنَا لَكَ الْحَمْدُ",
        "pronunciation": "রব্বানা লাকাল হামদ",
        "translation": "হে আমাদের রব! সকল প্রশংসা তোমরই।",
        "reference": "বুখারী: ৭২২"
    },
    {
        "id": 48,
        "category_id": 5,
        "title": "রুকুর দোয়া",
        "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيمِ",
        "pronunciation": "সুবহানা রাব্বিয়াল আজীম",
        "translation": "আমার মহান রবের পবিত্রতা ঘোষণা করছি।",
        "reference": "মুসলিম"
    },
    {
        "id": 49,
        "category_id": 5,
        "title": "সিজদাহর দোয়া",
        "arabic": "سُبْحَانَ رَبِّيَ الْأَعْلَى",
        "pronunciation": "সুবহানা রাব্বিয়াল আলা",
        "translation": "আমার সর্বোচ্চ রবের পবিত্রতা ঘোষণা করছি।",
        "reference": "মুসলিম"
    },
    {
        "id": 50,
        "category_id": 5,
        "title": "দুই সিজদাহর মাঝের দোয়া",
        "arabic": "اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَعَافِنِي وَارْزُقْنِي",
        "pronunciation": "আল্লাহুম্মাগফির লি ওয়ারহামনি ওয়াহদিনি ওয়া আফিনি ওয়ারজুকনি",
        "translation": "হে আল্লাহ! আমাকে ক্ষমা করো, আমার প্রতি দয়া করো, আমাকে হেদায়েত দাও, সুস্থ রাখো এবং রিজিক দাও।",
        "reference": "আবু দাউদ: ৮৫০"
    },
    {
        "id": 51,
        "category_id": 5,
        "title": "তাশাহহুদ (আত্তাহিয়াতু)",
        "arabic": "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ. أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
        "pronunciation": "আত্তাহিয়াতু লিল্লাহি ওয়াস-সালাওয়াতু ওয়াত-তয়্যিবাতু আস-সালামু আলাইকা আইয়ুহান নাবিয়্যু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু। আস-সালামু আলাইনা ওয়া আলা ইবাদিল্লাহিস সালিহীন। আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।",
        "translation": "সকল মৌখিক, দৈহিক ও আর্থিক ইবাদত আল্লাহর জন্য। হে নবী! আপনার ওপর শান্তি, আল্লাহর রহমত ও বরকত বর্ষিত হোক। আমাদের ওপর এবং আল্লাহর নেক বান্দাদের ওপর শান্তি বর্ষিত হোক। আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোনো মাবুদ নেই এবং আমি আরও সাক্ষ্য দিচ্ছি যে, মুহাম্মদ (সা.) তাঁর বান্দা ও রাসূল।",
        "reference": "বুখারী: ৬২৬৫"
    },
    {
        "id": 52,
        "category_id": 5,
        "title": "দরুদ শরীফ",
        "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ. اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
        "pronunciation": "আল্লাহুম্মা সাল্লি আলা মুহাম্মাদিও ওয়া আলা আলি মুহাম্মাদিন কামা সাল্লাইতা আলা ইব্রাহীমা ওয়া আলা আলি ইব্রাহীমা ইন্নাকা হামীদুম মাজীদ। আল্লাহুম্মা বারিক আলা মুহাম্মাদিও ওয়া আলা আলি মুহাম্মাদিন কামা বারাকতা আলা ইব্রাহীমা ওয়া আলা আলি ইব্রাহীমা ইন্নাকা হামীদুম মাজীদ।",
        "translation": "হে আল্লাহ! তুমি মুহাম্মদ (সা.) ও তাঁর বংশধরদের ওপর রহমত বর্ষণ করো, যেমন তুমি ইব্রাহিম (আ.) ও তাঁর বংশধরদের ওপর রহমত বর্ষণ করেছ। নিশ্চয়ই তুমি প্রশংসিত ও সম্মানিত। হে আল্লাহ! তুমি মুহাম্মদ (সা.) ও তাঁর বংশধরদের ওপর বরকত নাজিল করো, যেমন তুমি ইব্রাহিম (আ.) ও তাঁর বংশধরদের ওপর বরকত নাজিল করেছ। নিশ্চয়ই তুমি প্রশংসিত ও সম্মানিত।",
        "reference": "বুখারী: ৩৩৭০"
    },
    {
        "id": 53,
        "category_id": 5,
        "title": "সালাম ফেরানোর আগের দোয়া (দোয়া মাছুরা)",
        "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
        "pronunciation": "আল্লাহুম্মা ইন্নি জালামতু নাফসি জুলমান কাসিরাও ওয়ালা ইয়াগফিরুজ জুনূবা ইল্লা আনতা ফাগফিরলি মাগফিরাতাম মিন ইনদিকা ওয়ারহামনি ইন্নাকা আনতাল গাফুরুর রাহীম",
        "translation": "হে আল্লাহ! আমি আমার নিজের ওপর অনেক জুলুম করেছি। আর তুমি ছাড়া গুনাহ ক্ষমা করার কেউ নেই। অতএব, তুমি তোমার পক্ষ থেকে আমাকে বিশেষভাবে ক্ষমা করো এবং আমার প্রতি দয়া করো। নিশ্চয়ই তুমি ক্ষমাশীল ও দয়ালু।",
        "reference": "বুখারী: ৮৩৪"
    },
    {
        "id": 54,
        "category_id": 5,
        "title": "সালাম ফেরানোর পর দোয়া",
        "arabic": "أَسْتَغْفِرُ اللهَ (৩ বার) اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
        "pronunciation": "আস্তাগফিরুল্লাহ (৩ বার)। আল্লাহুম্মা আনতাস সালামু ওয়া মিনকাস সালামু তাবারাকতা ইয়া জাল জালালি ওয়াল ইকরাম",
        "translation": "আমি আল্লাহর ক্ষমা প্রার্থনা করছি। হে আল্লাহ! তুমিই শান্তি, তোমার থেকেই শান্তি। তুমি বরকতময়, হে মহিমাময় ও সম্মানদাতা।",
        "reference": "মুসলিম: ১২১"
    },
    {
        "id": 55,
        "category_id": 5,
        "title": "বিতর নামাজের কুনুত",
        "arabic": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
        "pronunciation": "আল্লাহুম্মাহ দিনি ফিমান হাদাইত, ওয়া আফিনি ফিমান আফাইত, ওয়া তাওয়াল্লানি ফিমান তাওয়াল্লাইত, ওয়া বারিক লি ফিমা আ‘তাইন, ওয়া কিনি শাররা মা কাদাইত, ফাইন্নাকা তাকদি ওয়ালা ইউকদা আলাইক, ইন্নাহু লা ইয়াজিল্লু মান ওয়ালাইত, তাবারাকতা রব্বানা ওয়া তাআলাইত",
        "translation": "হে আল্লাহ! তুমি যাদের হেদায়েত দিয়েছ, আমাকে তাদের অন্তর্ভুক্ত করো। তুমি যাদের সুস্থ রেখেছ, আমাকে তাদের অন্তর্ভুক্ত করো। তুমি যাদের অভিভাবক হয়েছ, আমাকে তাদের অন্তর্ভুক্ত করো। তুমি যা দিয়েছ, তাতে বরকত দাও। তুমি যে ফয়সালা করেছ, তার অনিষ্ট থেকে আমাকে রক্ষা করো। কারণ তুমিই ফয়সালা করো, তোমার ওপর ফয়সালা করার কেউ নেই। তুমি যার বন্ধু হয়েছ, সে অপমানে পতিত হয় না। হে আমাদের রব! তুমি বরকতময় ও সুউচ্চ।",
        "reference": "আবু দাউদ: ১৪২৫"
    },
    {
        "id": 56,
        "category_id": 6,
        "sub_category_id": 1,
        "title": "নতুন দম্পতির জন্য দোয়া",
        "arabic": "بَارَكَ اللهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
        "pronunciation": "বারাকাল্লাহু লাকা ওয়া বারাকা আলাইকা ওয়া জামাআ বাইনাকুমা ফি খাইর",
        "translation": "আল্লাহ তোমার জন্য বরকত দিন, তোমার ওপর বরকত দিন এবং তোমাদের উভয়কে কল্যাণের সাথে একত্রিত করুন।",
        "reference": "আবু দাউদ: ২১৩০"
    },
    {
        "id": 57,
        "category_id": 6,
        "sub_category_id": 1,
        "title": "স্বামী-স্ত্রীর মিলনের দোয়া",
        "arabic": "بِسْمِ اللهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا",
        "pronunciation": "বিসমিল্লাহি, আল্লাহুম্মা জান্নিবনাশ শাইতানা ওয়া জান্নিবিশ শাইতানা মা রাজাকতানা",
        "translation": "আল্লাহর নামে। হে আল্লাহ! আমাদের শয়তান থেকে দূরে রাখো এবং আমাদের যে সন্তান দান করবে, তাকেও শয়তান থেকে দূরে রাখো।",
        "reference": "বুখারী: ৬৩৮৮"
    },
    {
        "id": 58,
        "category_id": 6,
        "sub_category_id": 2,
        "title": "সফরের দোয়া",
        "arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
        "pronunciation": "সুবহানাল্লাজি সাখখারা লানা হাজা ওয়া মা কুন্না লাহু মুকরিনীন ওয়া ইন্না ইলা রাব্বিনা লামুন কালিবূন",
        "translation": "পবিত্র সেই সত্তা যিনি একে আমাদের বশীভূত করে দিয়েছেন, অথচ আমরা একে বশীভূত করতে সক্ষম ছিলাম না। আর আমরা অবশ্যই আমাদের রবের কাছে ফিরে যাব।",
        "reference": "সূরা যুখরুফ: ১৩-১৪"
    },
    {
        "id": 59,
        "category_id": 6,
        "sub_category_id": 2,
        "title": "কোনো শহরে বা গ্রামে প্রবেশের দোয়া",
        "arabic": "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الْأَرَضِينَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّيَاطِينِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا وَخَيْرَ مَا فِيهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ أَهْلِهَا وَشَرِّ مَا فِيهَا",
        "pronunciation": "আল্লাহুম্মা রব্বাস সামাওয়াতিস সাবই ওয়ামা আজলালনা, ওয়া রাব্বাল আরাদীনার সাবই ওয়ামা আকলালনা, ওয়া রাব্বাশ শায়াতিনি ওয়ামা আদলালনা, ওয়া রাব্বার রিয়াহি ওয়ামা জারাইনা, আসআলুকা খাইরা হাজিহিল কারইয়াতি ওয়া খাইরা আহলিহা ওয়া খাইরা মা ফীহা, ওয়া আউযুবিকা মিন শাররিহা ওয়া শাররি আহলিহা ওয়া শাররি মা ফীহা",
        "translation": "হে আল্লাহ! সাত আসমান ও তা যা ছায়া দিয়েছে তার রব, সাত জমিন ও তা যা বহন করছে তার রব, শয়তান ও সে যা পথভ্রষ্ট করেছে তার রব এবং বাতাস ও তা যা উড়িয়ে নিয়েছে তার রব! আমি তোমার কাছে এই জনপদ, এর অধিবাসী এবং এর মধ্যে যা আছে সবকিছুর কল্যাণ চাই। আর এর অনিষ্ট, এর অধিবাসীদের অনিষ্ট এবং এর মধ্যে যা অনিষ্ট আছে তা থেকে আশ্রয় চাই।",
        "reference": "নাসায়ী"
    },
    {
        "id": 60,
        "category_id": 6,
        "sub_category_id": 3,
        "title": "দুধ পান করার দোয়া",
        "arabic": "اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ",
        "pronunciation": "আল্লাহুম্মা বারিক লানা ফীহি ওয়া যিদনা মিনহু",
        "translation": "হে আল্লাহ! এতে আমাদের বরকত দাও এবং তা আরও বাড়িয়ে দাও।",
        "reference": "আবু দাউদ: ৩৭৩০"
    },
    {
        "id": 61,
        "category_id": 6,
        "title": "কবর জিয়ারতের দোয়া",
        "arabic": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَلَاحِقُونَ، أَسْأَلُ اللهَ لَنَا وَلَكُمُ الْعَافِيَةَ",
        "pronunciation": "আসসালামু আলাইকুম আহলাদ দিয়ারি মিনাল মু’মিনিনা ওয়াল মুসলিমীন, ওয়া ইন্না ইনশাআল্লাহু বিকুম লালাহিকূন, আসআলুল্লাহু লানা ওয়া লাকুমুল আফিয়াহ",
        "translation": "হে মুমিন ও মুসলিম কবরবাসীগণ! তোমাদের ওপর শান্তি বর্ষিত হোক। আল্লাহর ইচ্ছায় আমরাও তোমাদের সাথে মিলিত হবো। আমি আল্লাহর কাছে আমাদের ও তোমাদের জন্য নিরাপত্তা প্রার্থনা করছি।",
        "reference": "মুসলিম: ৯৭৫"
    },
    {
        "id": 62,
        "category_id": 6,
        "title": "মৃত ব্যক্তিকে কবরে রাখার দোয়া",
        "arabic": "بِسْمِ اللهِ وَعَلَى مِلَّةِ رَسُولِ اللهِ",
        "pronunciation": "বিসমিল্লাহ ওয়া আলা মিল্লাতি রাসূলিল্লাহ",
        "translation": "আল্লাহর নামে এবং আল্লাহর রাসূলের দ্বীনের ওপর (রাখছি)।",
        "reference": "আবু দাউদ: ৩২১৩"
    },
    {
        "id": 63,
        "category_id": 6,
        "title": "বৃষ্টি চাওয়ার দোয়া",
        "arabic": "اللَّهُمَّ اسْقِنَا غَيْثًا مُغِيثًا مَرِيئًا مَرِيعًا نَافِعًا غَيْرَ ضَارٍّ عَاجِلًا غَيْرَ آجِلٍ",
        "pronunciation": "আল্লাহুম্মাস কিনা গাইসাম মুগীসাম মারীআম মারীআন নাফিআন গাইরা দাররিন আজিলান গাইরা আজিল",
        "translation": "হে আল্লাহ! আমাদের এমন বৃষ্টি দান করো যা সাহায্যকারী, তৃপ্তিদায়ক, উর্বর, উপকারী—ক্ষতিকর নয়, এবং যা অবিলম্বে বর্ষিত হয়, বিলম্বে নয়।",
        "reference": "আবু দাউদ: ১১৬৯"
    },
    {
        "id": 64,
        "category_id": 6,
        "title": "নতুন চাঁদ দেখার দোয়া",
        "arabic": "اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ وَالتَّوْفِيقِ لِمَا تُحِبُّ وَتَرْضَى رَبُّنَا وَرَبُّكَ اللَّهُ",
        "pronunciation": "আল্লাহুম্মা আহিল্লাহু আলাইনা বিল আমনি ওয়াল ঈমানি ওয়াস সালামাতি ওয়াল ইসলামি ওয়াত তাওফিকি লিমা তুহিব্বু ওয়া তারদা রাব্বুনা ওয়া রাব্বুকাল্লাহ",
        "translation": "হে আল্লাহ! এই চাঁদকে আমাদের ওপর নিরাপত্তা, ঈমান, শান্তি ও ইসলাম এবং তুমি যা পছন্দ করো ও যাতে সন্তুষ্ট হও, তার তাওফিকের সাথে উদিত করো। আমার ও তোমার রব হলেন আল্লাহ।",
        "reference": "তিরমিযি"
    }
]